# Brewfile — managed by chezmoi
# Install: brew bundle --file=Brewfile

# ─── CLI essentials ──────────────────────────────────────────────────────────
brew "eza"           # Modern ls
brew "bat"           # Modern cat
brew "sd"            # Modern sed
brew "fd"            # Modern find
brew "ripgrep"
brew "ripgrep-all"   # ripgrep for PDFs, DOCX, ZIPs
brew "jq"            # JSON processor
brew "yq"            # YAML/JSON/XML/CSV processor
brew "jless"         # Interactive JSON viewer
brew "gron"          # Make JSON greppable
brew "fx"            # Interactive JSON viewer and processor
brew "curl"
brew "wget"
brew "xh"            # Modern curl for APIs
brew "broot"         # Directory navigation
brew "trash-cli"     # Safe rm
brew "tealdeer"      # Faster tldr
brew "ghostscript"
brew "imagemagick"

# ─── System monitoring ──────────────────────────────────────────────────────
brew "btop"          # Modern htop
brew "dust"          # Modern du
brew "duf"           # Modern df
brew "procs"         # Modern ps
brew "bottom"        # Alt to btop (Rust-based)

# ─── Network tools ──────────────────────────────────────────────────────────
brew "bandwhich"     # Network bandwidth monitor
brew "doggo"         # DNS client
brew "gping"         # Graphical ping
brew "trippy"        # Modern traceroute

# ─── Git tools ───────────────────────────────────────────────────────────────
brew "git"
brew "git-cliff"     # Changelog generator
brew "onefetch"      # Git repo info display
brew "ghq"           # Git repository manager
brew "lazygit"       # Git TUI
brew "gh"            # GitHub CLI
brew "delta"         # Git diff viewer
brew "difftastic"    # Structural diffs
brew "jj"            # Jujutsu VCS

# ─── Development tools ──────────────────────────────────────────────────────
brew "just"          # Modern task runner
brew "tokei"         # Code statistics
brew "uv"            # Fast Python package installer
brew "node"          # Node.js
brew "yarn"
brew "shellcheck"
brew "hyperfine"     # Benchmarking
brew "entr"          # Run command on file change
brew "mise"          # Polyglot runtime version manager

# ─── Container/Cloud tools ──────────────────────────────────────────────────
brew "lazydocker"    # Docker TUI
brew "kubectl"       # Kubernetes CLI
brew "k9s"           # Kubernetes TUI
brew "kubectx"       # K8s context switcher (includes kubens)
brew "helm"          # Kubernetes package manager
brew "helmfile"      # Declarative helm management
brew "kustomize"     # K8s config overlays
brew "stern"         # Multi-pod log tailing
brew "awscli"        # AWS CLI
cask "gcloud-cli"    # Google Cloud SDK
brew "terraform"
brew "terragrunt"

# ─── Terminal & Shell ────────────────────────────────────────────────────────
brew "zsh"
brew "zoxide"        # Smart cd
brew "fzf"           # Fuzzy finder
brew "atuin"         # Shell history
brew "starship"      # Prompt
brew "direnv"        # Auto env loading
brew "tmux"
brew "glow"          # Markdown viewer
brew "viddy"         # Modern watch
brew "navi"          # Interactive cheatsheet
brew "mprocs"        # Run multiple processes in TUI
brew "posting"       # TUI HTTP client
brew "autossh"

# ─── Security ────────────────────────────────────────────────────────────────
brew "age"           # Modern encryption
brew "sops"          # Encrypted file editor

# ─── Editor & Tools ─────────────────────────────────────────────────────────
brew "neovim"
brew "yazi"          # File manager
brew "claude-code"   # Anthropic Claude CLI
brew "chezmoi"
brew "asciinema"     # Terminal recording
brew "vhs"           # Record terminal to GIF

# ─── macOS Casks ─────────────────────────────────────────────────────────────
cask "ghostty"
cask "raycast"
cask "zoom"
cask "google-chrome"
cask "karabiner-elements"
cask "font-maple-mono-nf-cn"
