# ─── Taps ─────────────────────────────────────────────────────────────────────
tap "charmbracelet/tap"    # vhs
tap "zegervdv/zathura"

# ─── CLI tools ────────────────────────────────────────────────────────────────
brew "eza"
brew "bat"
brew "jq"
brew "curl"
brew "wget"
brew "xh"
brew "btop"
brew "dust"
brew "duf"
brew "procs"
brew "bottom"
brew "tealdeer"
brew "trash-cli"
brew "entr"
brew "autossh"
brew "yarn"
brew "ripgrep"
brew "ripgrep-all"
brew "sshfs"
brew "fd"
brew "ghostscript"
brew "imagemagick"
brew "yq"
brew "jless"
brew "gron"
brew "fx"
brew "hyperfine"
brew "bandwhich"
brew "doggo"
brew "gping"
brew "trippy"
brew "sd"
brew "broot"
brew "git-cliff"
brew "onefetch"
brew "just"
brew "tokei"
brew "uv"
brew "difftastic"
brew "glow"
brew "viddy"
brew "navi"
brew "mprocs"
brew "age"
brew "asciinema"
brew "charmbracelet/tap/vhs"
brew "mise"
brew "chezmoi"
brew "posting"

# ─── Git tools ────────────────────────────────────────────────────────────────
brew "git"
brew "ghq"
brew "lazygit"
brew "gh"
brew "git-delta"
brew "jujutsu"

# ─── Cloud / Infra ────────────────────────────────────────────────────────────
brew "lazydocker"
brew "kubectl"
brew "k9s"
brew "kubectx"      # includes kubens
brew "helm"
brew "helmfile"
brew "kustomize"
brew "stern"
brew "awscli"
brew "terraform"
brew "terragrunt"
cask "google-cloud-sdk"

# ─── Shell ────────────────────────────────────────────────────────────────────
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# ─── Terminal / Editor ────────────────────────────────────────────────────────
brew "tmux"
brew "neovim"
brew "zegervdv/zathura/zathura"
brew "zegervdv/zathura/zathura-pdf-mupdf"
brew "fzf"
brew "zoxide"
brew "atuin"
brew "starship"
brew "direnv"
brew "yazi"

# ─── Dev tools ────────────────────────────────────────────────────────────────
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "nodejs"        # for npm LSP servers; runtimes managed by mise

# ─── Apps (macOS casks) ───────────────────────────────────────────────────────
cask "macfuse"
cask "ghostty"
cask "raycast"
cask "zoom"
cask "karabiner-elements"

# ─── Fonts ────────────────────────────────────────────────────────────────────
cask "font-maple-mono-nf-cn"
